  ### Deployment Results ✅

  **jcetina** successfully deployed branch `jcetina/add-nat-gw` to **production**

  <details><summary>Show Results</summary>

  ```terraform
[command]/home/runner/work/_temp/29a04e56-c293-4de9-a8d8-41f09f9b8764/terraform-bin apply -no-color -auto-approve -compact-warnings

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

# azurerm_subnet_route_table_association.server_subnet_association will be created
+ resource "azurerm_subnet_route_table_association" "server_subnet_association" {
    + id             = (known after apply)
    + route_table_id = (known after apply)
    + subnet_id      = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/my-secure-vnet/subnets/ServerSubnet"
  }

# module.vnet.module.route_table.azurerm_route_table.route_table will be created
+ resource "azurerm_route_table" "route_table" {
    + disable_bgp_route_propagation = false
    + id                            = (known after apply)
    + location                      = "eastus"
    + name                          = "my-secure-route-table"
    + resource_group_name           = "org-jcetina-repo-baklava-rg"
    + route                         = [
        + {
            + address_prefix         = "0.0.0.0/0"
            + name                   = "ToFirewall"
            + next_hop_in_ip_address = "10.0.0.4"
            + next_hop_type          = "VirtualAppliance"
          },
        + {
            + address_prefix         = "10.0.0.0/16"
            + name                   = "VnetRoute"
            + next_hop_in_ip_address = ""
            + next_hop_type          = "VnetLocal"
          },
      ]
    + subnets                       = (known after apply)
  }

Plan: 2 to add, 0 to change, 0 to destroy.
module.vnet.module.route_table.azurerm_route_table.route_table: Creating...
module.vnet.module.route_table.azurerm_route_table.route_table: Creation complete after 3s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/routeTables/my-secure-route-table]
azurerm_subnet_route_table_association.server_subnet_association: Creating...
azurerm_subnet_route_table_association.server_subnet_association: Creation complete after 4s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/my-secure-vnet/subnets/ServerSubnet]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```

  </details>